In [1]:
%load_ext sql

In [2]:
%sql sqlite:///ABC_DATA.db

In [3]:
%%sql CREATE TABLE customers(
    customer_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR(20),
    last_name VARCHAR(20),
    email VARCHAR(30)
    );

 * sqlite:///ABC_DATA.db
Done.

[]

In [4]:
%sql PRAGMA table_info(customers)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'customer_id', 'INT', 1, None, 1),
 (1, 'first_name', 'VARCHAR(20)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(20)', 0, None, 0),
 (3, 'email', 'VARCHAR(30)', 0, None, 0)]

In [5]:
%%sql INSERT INTO customers VALUES (1,'Joe','Doe','johndoe@email.com');

 * sqlite:///ABC_DATA.db
1 rows affected.

[]

In [6]:
%sql SELECT * FROM customers

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Joe', 'Doe', 'johndoe@email.com')]

In [7]:
%%sql CREATE TABLE products(
    product_id INT,
    product_name VARCHAR(15),
    price DECIMAL
    );

 * sqlite:///ABC_DATA.db
Done.

[]

In [8]:
%%sql INSERT INTO products VALUES(1,'ProductA',10.00)

 * sqlite:///ABC_DATA.db
1 rows affected.

[]

In [9]:
%sql SELECT * FROM products

 * sqlite:///ABC_DATA.db
Done.

[(1, 'ProductA', 10)]

In [10]:
%%sql CREATE TABLE orders(
    order_id INT,
    customer_id INT,
    order_date TIMESTAMP
    );

 * sqlite:///ABC_DATA.db
Done.

[]

In [11]:
%sql SELECT * FROM orders

 * sqlite:///ABC_DATA.db
Done.

[]

In [12]:
%sql INSERT INTO orders VALUES(1,1,2023-05-01)

 * sqlite:///ABC_DATA.db
1 rows affected.

[]

In [13]:
%sql SELECT * FROM orders

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2017)]

Get a clarification on how to add the DATE

In [17]:
%%sql CREATE TABLE order_item(
    order_id INT,
    product_id INT,
    quantity INT
    );

 * sqlite:///ABC_DATA.db
Done.

[]

In [18]:
%sql INSERT INTO order_item VALUES(1,1,2)

 * sqlite:///ABC_DATA.db
1 rows affected.

[]

In [19]:
%sql SELECT * FROM order_item

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2)]